# -*- coding: utf8 -*-
import random
from pyfiglet import Figlet

preview_text = Figlet(font="slant", justify="right")
print(preview_text.renderText("Hangman"))

word_list = ['сэкономить', 'сэр', 'сюда', 'сюжет', 'сюзерен', 'сюита', 'сюрприз', 'сюртук', 'сюсюкать', 'сюсюкаться', 'сяк', 'сякой', 'сям', 'табак', 'табака', 'табакерка', 'табаковод', 'табаководство', 'табанить', 'табачник', 'табель', 'табельщик', 'таблетка', 'таблица', 'табло', 'табльдот', 'табор', 'табу', 'табун', 'табунщик', 'табурет', 'таверна', 'таволга', 'тавреный', 'таврить', 'тавро', 'тавровый', 'тавтология', 'таган', 'таджики', 'таежник', 'таежный', 'таз', 'тазобедренный', 'таинственный', 'таинство', 'таить', 'таиться', 'тайга', 'тайком', 'тайм', 'тайм-аут', 'таймень', 'тайна', 'тайник', 'тайнопись', 'тайный', 'тайфун', 'так', 'так-сяк', 'так-таки', 'такать', 'такелаж', 'такелажник', 'также', 'таки', 'таков', 'таковой', 'таковский', 'такой', 'такой-сякой', 'такса', 'такси', 'таксировать', 'таксист', 'таксомотор', 'таксопарк', 'такт', 'тактик', 'тактика', 'тактичный', 'талант', 'солнце', 'солнцепек', 'солнцестояние', 'солнышко', 'соло', 'соловей', 'соловеть', 'соловый', 'солод', 'солодка', 'солома', 'соломина', 'соломка', 'соломо', 'соломонов', 'соломорезка', 'солон', 'солонина', 'солонка', 'солонцы', 'солончаки', 'соль', 'сольный', 'сольфеджио', 'солянка', 'соляной', 'соляный', 'соляр', 'солярий', 'солярка', 'сом', 'соматический', 'сомбреро', 'сомкнуть', 'сомкнуться', 'сомлеть', 'сомнамбула', 'сомнамбулизм', 'сомневаться', 'сомнение', 'сомнительный', 'сомножитель', 'сон', 'соната', 'сонет', 'сонливец', 'сонливый', 'сонм', 'сонмище', 'сонник', 'сонный', 'соня', 'соображать', 'соображение', 'сообразительный', 'сообразить', 'сообразный', 'сообразовать', 'сообразоваться', 'сообща', 'сообщаться', 'сообщение', 'сообщество', 'сообщить', 'сообщиться', 'сообщник', 'соорудить', 'сооружение', 'соответственный', 'соответствие']


def game():
    word = random.choice(word_list)
    word_temp = word
    word_compl = "_" * len(word)
    l = list(word_compl)
    tries = 6
    guessed = False
    guessed_let = []
    print("Всього спроб: ", tries+1)
    while guessed is False:
        let = input("Введіть будь ласка літеру: ")
        if let.isalpha() is False:
            print("Це не літера!!\n")
            continue
        elif len(let) != 1:
            print("Введіть лише ОДНУ літеру\n")
            continue
        if let in word and let not in guessed_let:# якщо літера в слові але не називалась
            guessed_let.append(let)
            for i in range(word.count(let)):
                l[word_temp.find(let)] = let
                word_compl = "".join(l)
                word_temp = word_temp.replace(let, "f", 1)
            print(stages[tries])
            print("Така літерає у слові! Відкриваю...")
            print(word_compl)
            print("Всього спроб: ", tries+1, "\n")
        elif let in word and let in guessed_let:
            print(stages[tries])
            print("Ви вже вгадали цю літеру!")
            print(word_compl)
            print("Всього спроб: ", tries+1, "\n")
        elif let not in word:
            print(stages[tries])
            print("Цієї літери немає у слові(")
            print(word_compl)
            tries -= 1
            print("Всього спроб: ", tries+1, "\n")

        if sorted(set(word)) == sorted(set(guessed_let)):
            guessed = True

        if tries == -1:
            print("Ви програли!\nЗагадане слово -", word, "\n")
            rest_opt = input("Що хочете зробити?\n1 - грати заново\n2 - вийти з гри\n")
            if rest_opt == 1:
                menu()
            elif rest_opt == 2:
                quit()
            else:
                print("Не те число!! Направляю в меню...")
                menu()
        if guessed is True:
            win_txt = Figlet(font="slant", justify="right")
            print(win_txt.renderText("WIN!"))
            menu()


def menu():
    mn = int(input("Що ти хочеш зробити?\n1 - зіграти в гру\n2 - вийти з гри\n"))
    if mn == 1:
        print("Давайте грати!\n")
        game()
    elif mn == 2:
        quit()
    else:
        print("Не те число!!")
        menu()


stages = [
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           -
        ''',
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / 
           -
        ''',
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |      
           -
        ''',
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |     
           -
        ''',
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |     
           -
        ''',
        '''
           --------
           |      |
           |      O
           |    
           |      
           |     
           -
        ''',
        '''
           --------
           |      |
           |      
           |    
           |      
           |     
           -
        '''
    ]

menu()
